experiments/socialnetwork_singlenode/expected_results/write_qps1000/wrk_warmup.log
Running 30s test @ http://ip-172-31-12-93.us-east-2.compute.internal:8080
  4 threads and 48 connections
  Thread calibration: mean lat.: 23.223ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 23.160ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 11.604ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 23.206ms, rate sampling interval: 13ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.23ms  679.38us  18.82ms   74.91%
    Req/Sec   390.14     58.71   615.00     67.51%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.18ms
 75.000%    5.59ms
 90.000%    5.99ms
 99.000%    6.82ms
 99.900%   10.78ms
 99.990%   16.34ms
 99.999%   18.83ms
100.000%   18.83ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.063     0.000000            1         1.00
       4.475     0.100000         3007         1.11
       4.707     0.200000         6001         1.25
       4.887     0.300000         9029         1.43
       5.035     0.400000        12005         1.67
       5.183     0.500000        15011         2.00
       5.259     0.550000        16472         2.22
       5.335     0.600000        17955         2.50
       5.419     0.650000        19460         2.86
       5.503     0.700000        20957         3.33
       5.595     0.750000        22467         4.00
       5.647     0.775000        23212         4.44
       5.703     0.800000        23965         5.00
       5.763     0.825000        24706         5.71
       5.831     0.850000        25443         6.67
       5.911     0.875000        26193         8.00
       5.951     0.887500        26569         8.89
       5.995     0.900000        26920        10.00
       6.051     0.912500        27308        11.43
       6.107     0.925000        27682        13.33
       6.167     0.937500        28063        16.00
       6.199     0.943750        28234        17.78
       6.243     0.950000        28423        20.00
       6.283     0.956250        28603        22.86
       6.339     0.962500        28789        26.67
       6.411     0.968750        28985        32.00
       6.439     0.971875        29070        35.56
       6.475     0.975000        29166        40.00
       6.531     0.978125        29265        45.71
       6.575     0.981250        29354        53.33
       6.639     0.984375        29447        64.00
       6.683     0.985938        29492        71.11
       6.731     0.987500        29536        80.00
       6.791     0.989062        29583        91.43
       6.851     0.990625        29629       106.67
       6.951     0.992188        29676       128.00
       7.035     0.992969        29700       142.22
       7.095     0.993750        29724       160.00
       7.147     0.994531        29747       182.86
       7.243     0.995313        29769       213.33
       7.479     0.996094        29793       256.00
       7.679     0.996484        29804       284.44
       7.983     0.996875        29816       320.00
       8.279     0.997266        29828       365.71
       8.759     0.997656        29839       426.67
       9.431     0.998047        29852       512.00
       9.575     0.998242        29857       568.89
       9.823     0.998437        29863       640.00
       9.967     0.998633        29869       731.43
      10.359     0.998828        29874       853.33
      10.879     0.999023        29880      1024.00
      11.559     0.999121        29883      1137.78
      12.479     0.999219        29886      1280.00
      12.911     0.999316        29889      1462.86
      13.375     0.999414        29892      1706.67
      13.735     0.999512        29895      2048.00
      13.767     0.999561        29896      2275.56
      14.143     0.999609        29898      2560.00
      14.191     0.999658        29899      2925.71
      14.567     0.999707        29901      3413.33
      15.255     0.999756        29902      4096.00
      15.295     0.999780        29903      4551.11
      15.551     0.999805        29904      5120.00
      15.551     0.999829        29904      5851.43
      15.639     0.999854        29905      6826.67
      16.343     0.999878        29906      8192.00
      16.343     0.999890        29906      9102.22
      16.559     0.999902        29907     10240.00
      16.559     0.999915        29907     11702.86
      16.559     0.999927        29907     13653.33
      17.919     0.999939        29908     16384.00
      17.919     0.999945        29908     18204.44
      17.919     0.999951        29908     20480.00
      17.919     0.999957        29908     23405.71
      17.919     0.999963        29908     27306.67
      18.831     0.999969        29909     32768.00
      18.831     1.000000        29909          inf
#[Mean    =        5.228, StdDeviation   =        0.679]
#[Max     =       18.816, Total count    =        29909]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    4.34ms
 75.000%    4.62ms
 90.000%    4.89ms
 99.000%    5.54ms
 99.900%    9.87ms
 99.990%   15.47ms
 99.999%   17.47ms
100.000%   17.47ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.937     0.000000            1         1.00
       3.847     0.100000         3013         1.11
       4.005     0.200000         5994         1.25
       4.127     0.300000         8977         1.43
       4.239     0.400000        12037         1.67
       4.343     0.500000        15045         2.00
       4.399     0.550000        16517         2.22
       4.451     0.600000        17984         2.50
       4.503     0.650000        19482         2.86
       4.563     0.700000        21036         3.33
       4.623     0.750000        22472         4.00
       4.659     0.775000        23262         4.44
       4.695     0.800000        23973         5.00
       4.739     0.825000        24724         5.71
       4.783     0.850000        25470         6.67
       4.835     0.875000        26181         8.00
       4.863     0.887500        26549         8.89
       4.891     0.900000        26923        10.00
       4.927     0.912500        27302        11.43
       4.967     0.925000        27683        13.33
       5.015     0.937500        28063        16.00
       5.039     0.943750        28229        17.78
       5.071     0.950000        28427        20.00
       5.103     0.956250        28610        22.86
       5.143     0.962500        28794        26.67
       5.195     0.968750        28987        32.00
       5.223     0.971875        29082        35.56
       5.255     0.975000        29164        40.00
       5.291     0.978125        29263        45.71
       5.327     0.981250        29350        53.33
       5.379     0.984375        29443        64.00
       5.415     0.985938        29492        71.11
       5.459     0.987500        29537        80.00
       5.507     0.989062        29586        91.43
       5.583     0.990625        29632       106.67
       5.671     0.992188        29677       128.00
       5.779     0.992969        29699       142.22
       5.879     0.993750        29724       160.00
       6.039     0.994531        29747       182.86
       6.211     0.995313        29770       213.33
       6.619     0.996094        29793       256.00
       6.835     0.996484        29804       284.44
       6.995     0.996875        29816       320.00
       7.435     0.997266        29828       365.71
       7.851     0.997656        29839       426.67
       8.295     0.998047        29851       512.00
       8.631     0.998242        29857       568.89
       8.823     0.998437        29863       640.00
       9.239     0.998633        29869       731.43
       9.351     0.998828        29874       853.33
      10.095     0.999023        29880      1024.00
      10.479     0.999121        29883      1137.78
      11.359     0.999219        29886      1280.00
      11.687     0.999316        29889      1462.86
      12.607     0.999414        29892      1706.67
      13.023     0.999512        29895      2048.00
      13.287     0.999561        29896      2275.56
      13.407     0.999609        29898      2560.00
      13.599     0.999658        29899      2925.71
      13.863     0.999707        29901      3413.33
      13.903     0.999756        29902      4096.00
      14.447     0.999780        29903      4551.11
      14.471     0.999805        29904      5120.00
      14.471     0.999829        29904      5851.43
      14.615     0.999854        29905      6826.67
      15.471     0.999878        29906      8192.00
      15.471     0.999890        29906      9102.22
      15.807     0.999902        29907     10240.00
      15.807     0.999915        29907     11702.86
      15.807     0.999927        29907     13653.33
      17.039     0.999939        29908     16384.00
      17.039     0.999945        29908     18204.44
      17.039     0.999951        29908     20480.00
      17.039     0.999957        29908     23405.71
      17.039     0.999963        29908     27306.67
      17.471     0.999969        29909     32768.00
      17.471     1.000000        29909          inf
#[Mean    =        4.377, StdDeviation   =        0.534]
#[Max     =       17.456, Total count    =        29909]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  44977 requests in 30.00s, 9.22MB read
  Non-2xx or 3xx responses: 10
Requests/sec:   1499.19
Transfer/sec:    314.82KB